return {
  {
    "folke/snacks.nvim",
    priority = 1000,
    lazy = false,
    opts = {
      dashboard = {
        preset = {
          header = [[
      ███╗   ██╗███████╗ ██████╗    ██╗   ██╗██╗███╗   ███╗     
      ████╗  ██║██╔════╝██╔═══██╗   ██║   ██║██║████╗ ████║    z
      ██╔██╗ ██║█████╗  ██║   ██║   ██║   ██║██║██╔████╔██║  z  
      ██║╚██╗██║██╔══╝  ██║   ██║   ╚██╗ ██╔╝██║██║╚██╔╝██║ z   
      ██║ ╚████║███████╗╚██████╔╝    ╚████╔╝ ██║██║ ╚═╝ ██║     
      ╚═╝  ╚═══╝╚══════╝ ╚═════╝      ╚═══╝  ╚═╝╚═╝     ╚═╝     
          ]],
          keys = {
            { icon = " ", key = "f", desc = "  Find", action = ":Telescope find_files" },
            { icon = " ", key = "g", desc = "󰦨  Grep", action = ":Telescope live_grep" },
            { icon = " ", key = "l", desc = "󰒲  Lazy", action = ":Lazy" },
            { icon = " ", key = "q", desc = "󰬘  Quit", action = ":qa" },
          },
        },
      },
    },
  },
}
